In [4]:
import pandas as pd
import numpy as np
import random
import string

In [5]:
pd.DataFrame({"A":[1,2],"B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [6]:
pd.DataFrame({"A":[1,2],"B":[3,4],"C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [7]:
pd.DataFrame([[4,7,10],[1,2,3]], index=[1,2], columns=['A','B','C'])

   A  B   C
1  4  7  10
2  1  2   3

In [8]:
pd.DataFrame([[1,2,3],[5,6,7],[1,2,4],[1,4,8]], index=range(1,5), columns=['A','B','C'])

   A  B  C
1  1  2  3
2  5  6  7
3  1  2  4
4  1  4  8

In [9]:
pd.Series({"한국":"서울","일본":"도쿄","중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [10]:
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  27  94  95
1  18  84  68

In [11]:
np.random.randint(50, 100)

77

In [12]:
def student():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [13]:
student()

'CFmXu'

In [14]:
def score():
    return np.random.randint(50, 100)

In [15]:
score()

79

In [16]:
pd.DataFrame([[score() for i in range(4)] for i in range(10)], index=[student() for i in range(10)],columns=['국어','영어','수학','사회'])

       국어  영어  수학  사회
gqWwf  91  96  93  95
nkTSj  92  62  94  72
XVWFr  80  61  97  90
gfUBM  77  61  55  75
ALUVT  59  61  75  60
qGpxQ  57  51  64  58
rVBkm  62  62  60  51
IqyzZ  96  98  78  98
kGDdJ  57  72  92  53
LsCea  54  74  98  82

In [17]:
pd.DataFrame({"국어":[score() for i in range(10)], "영어":[score() for i in range(10)], "수학":[score() for i in range(10)], "사회":[score() for i in range(10)]}, index=[student() for i in range(10)])

       국어  영어  수학  사회
udgFU  78  72  57  76
jgMdC  70  52  87  73
vttod  57  93  59  84
SQPne  78  98  55  77
ubJSB  79  51  54  71
KJVBv  65  76  53  68
YFUvx  84  61  90  51
DnoRQ  50  53  71  65
IOAGK  73  90  69  69
zcmob  72  84  82  55

In [18]:
pd.DataFrame(np.random.randint(50, 100, size=(10,4)), index=[student() for i in range(10)],columns=['국어','영어','수학','사회'])

       국어  영어  수학  사회
HWoll  77  74  62  81
fAOux  52  60  62  59
CucgH  65  51  97  61
Zzrng  58  57  63  85
vrIDC  70  80  85  98
NxDyd  54  55  59  56
FYUMe  65  58  61  95
KJtqq  87  74  90  95
nExcc  76  60  74  63
qukJc  58  78  98  57

In [21]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[student()])
for i in range(1,10):
    df.loc[student()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

       국어  영어  수학  사회
yGMpA  92  83  93  54
EDTaQ  71  64  83  82
yIGTd  89  68  81  53
KPogr  53  91  68  92
pzdjV  99  73  72  84
EGYGU  96  79  81  63
NqObE  58  91  96  67
chklD  92  92  74  59
TTgJw  90  74  85  73
pdhgv  73  90  85  86